ConfigFiles/InformationRegisters/РезультатыПроверкиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РезультатыПроверкиОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исключение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ошибки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПравилоПроверкиОбъектов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаПроверкиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Процессы</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрофилиПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Подсистемы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТехническиеПроекты</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДоступа</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФункцииСистемы</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
						<v8:Type>cfg:CatalogRef.РазделыПроекта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭлементОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШагиПроцесса</v8:Type>
						<v8:Type>cfg:CatalogRef.РеквизитыОбъектовМетаданных</v8:Type>
						<v8:Type>cfg:CatalogRef.МакетыОбъектовМетаданных</v8:Type>
						<v8:Type>cfg:CatalogRef.ФормыОбъектовМетаданных</v8:Type>
						<v8:Type>cfg:CatalogRef.ФункцииМеханизмов</v8:Type>
						<v8:Type>cfg:CatalogRef.ПредопределенныеДанные</v8:Type>
						<v8:Type>cfg:CatalogRef.КомандыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ConfigFiles/InformationRegisters/РезультатыПроверкиОбъектов/Forms/РезультатыПроверки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОбъектПроверкиВЗаголовке") Тогда
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Результаты проверки (%1)'"),
							Строка(Параметры.ОбъектПроверкиВЗаголовке));
							
		АвтоЗаголовок = Ложь;
	КонецЕсли; 
	
	Если Параметры.Отбор.Свойство("ПравилоПроверкиОбъектов") Тогда
	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПравилоПроверки", Параметры.Отбор.ПравилоПроверкиОбъектов);
		Элементы.ПравилоПроверки.Видимость = Ложь;
	
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("ОбъектПроверки") Тогда
	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ОбъектПроверки", Параметры.Отбор.ОбъектПроверки);
		Элементы.ОбъектПроверки.Видимость = Ложь;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбраннаяСтрока<>Неопределено Тогда
		Если Поле.Имя = "ОбъектПроверки" ИЛИ Поле.Имя = "ПравилоПроверки" Тогда
			ПоказатьЗначение(Неопределено, Элемент.ТекущиеДанные[Поле.Имя]);
		ИначеЕсли Поле.Имя = "Ошибка" Тогда
			ОткрытьФорму("Справочник.Ошибки.ФормаОбъекта",Новый Структура("Ключ", Элемент.ТекущиеДанные.Ошибка));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыСписок

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьПроверкуВсехПравил(Команда)
	
	ТекстЗаголовка = НСтр("ru='Выполнение правил проверки'");
	ТекстСостояния = НСтр("ru='Выполняется применение правил проверки'");
	Состояние(ТекстЗаголовка,,ТекстСостояния);
	
	ВыполнитьПроверкуВсехПравилСервер();
	
	Оповестить("Запись_РезультатыПроверкиОбъектов");
	
	ТекстЗаголовка = НСтр("ru='Выполнение правил проверки'");
	ТекстПояснения = НСтр("ru='Выполнено применение всех правил проверки'");
	
	ПоказатьОповещениеПользователя(ТекстЗаголовка,,ТекстПояснения, БиблиотекаКартинок.Информация32);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметкуИсключения(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОтметкиИсключенияСервер(ВыделенныеСтроки, Истина);
	
	Оповестить("Запись_РезультатыПроверкиОбъектов");
	
	ТекстЗаголовка = НСтр("ru='Установка отметок'");
	ТекстПояснения = НСтр("ru='Для выделенных строк установлены отметки исключения'");
	ПоказатьОповещениеПользователя(ТекстЗаголовка,,ТекстПояснения, БиблиотекаКартинок.Информация32);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкуИсключения(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОтметкиИсключенияСервер(ВыделенныеСтроки, Ложь);
	
	Оповестить("Запись_РезультатыПроверкиОбъектов");
	
	ТекстЗаголовка = НСтр("ru='Снятие отметок'");
	ТекстПояснения = НСтр("ru='Для выделенных строк сняты отметки исключения'");
	ПоказатьОповещениеПользователя(ТекстЗаголовка,,ТекстПояснения, БиблиотекаКартинок.Информация32);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПрименениеПравилПроверки" ИЛИ ИмяСобытия = "ИзмененТекущийПроект" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьОшибки(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество()=0 Тогда
		Возврат;
	КонецЕсли;

	КолОшибок = ЗарегистрироватьОшибкиСервер(ВыделенныеСтроки);
	
	Если КолОшибок > 0 Тогда	
		ТекстЗаголовка = НСтр("ru='Регистрация ошибок'");
		ТекстПояснения = НСтр("ru='по выделенным строкам'");
		ПоказатьОповещениеПользователя(ТекстЗаголовка,, ТекстПояснения, БиблиотекаКартинок.Информация32);	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьПроверкуВсехПравилСервер()
	
	ПроверкаОбъектов.ВыполнитьПроверкуОбъектов();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтметкиИсключенияСервер(ВыделенныеСтроки, ЗначениеОтметки)
	
	ПроверкаОбъектов.УстановитьСнятьОтметкуИсключения(ВыделенныеСтроки, ЗначениеОтметки);
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьОшибкиСервер(ВыделенныеЗаписи)
	
	ОшибкиПоМетаданным = Новый Массив;
	
	Для каждого КлючЗаписи из ВыделенныеЗаписи Цикл
		Если ТипЗнч(КлючЗаписи.ОбъектПроверки) = Тип("СправочникСсылка.ОбъектыМетаданных") Тогда
			ОшибкиПоМетаданным.Добавить(КлючЗаписи);
		КонецЕсли;
	КонецЦикла;
	
	Если ОшибкиПоМетаданным.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли; 
	
	РегистрыСведений.РезультатыПроверкиОбъектов.ЗарегистрироватьОшибки(ОшибкиПоМетаданным);
	Элементы.Список.Обновить();
	
	Возврат ОшибкиПоМетаданным.Количество();
	
КонецФункции

#КонецОбласти
